app/Http/Controllers/User/UserClientController.php

SELECT `id`, `dui`, `name`, `lastname`, `phone`, `deleted_at` FROM `clients` WHERE `gym_id` = 1 and `clients`.`deleted_at` IS not NULL LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `clients` WHERE `gym_id` = 1 and `clients`.`deleted_at` IS not NULL
---
    public function index()
    {
        //dd(request()->user()->hasPermissionTo('view clients'));
        return Inertia::render('User/User_Client/Index',[
            'clients' => Client::select(['id','dui','name','lastname','phone','deleted_at'])->latest('created_at')->where('gym_id',request()->user()->gym_id)->filter(request(['search','trashed']))
            ->paginate(5)->withQueryString(),
            'filters' => \Illuminate\Support\Facades\Request::only(['search','trashed']),
        ]);

SELECT `training_sessions`.*, `attendances`.`client_id` as `pivot_client_id`, `attendances`.`training_session_id` as `pivot_training_session_id`, `attendances`.`attendance_date` as `pivot_attendance_date` FROM `training_sessions` inner join `attendances` on `training_sessions`.`id` = `attendances`.`training_session_id` WHERE `attendances`.`client_id` = 2 and (`name` like '%rerum%' or `description` like '%rerum%' or `duration` like '%rerum%' or `starts_at` like '%rerum%' or `finish_at` like '%rerum%') ORDER BY `attendance_date` DESC LIMIT 8 offset 0
SELECT * FROM `card_transactions` WHERE `card_transactions`.`client_id` in (1) ORDER BY `created_at` DESC
SELECT * FROM `cash_transactions` WHERE `cash_transactions`.`client_id` in (1) ORDER BY `created_at` DESC
SELECT * FROM `departments` WHERE `departments`.`id` in (2)
SELECT count(*) as aggregate FROM `training_sessions` inner join `attendances` on `training_sessions`.`id` = `attendances`.`training_session_id` WHERE `attendances`.`client_id` = 2
---
    public function show(Client $client)
    {
        return Inertia::render('User/User_Client/Show',[
            'client' => $client->load(['suscriptions.plan','purchases','system_client','gym.department','cardTransactions','cashTransactions']),
            'client_attendance_training_sessions' => $client->attendances_training_sessions()->when(\Illuminate\Support\Facades\Request::input('search') ?? false, function($query , $search) {
                $query->where(fn($query) =>
                    $query->where('name','like','%'.$search.'%')
                        ->orWhere('description','like','%'.$search.'%')
                        ->orWhere('duration','like','%'.$search.'%')
                        ->orWhere('starts_at','like','%'.$search.'%')
                        ->orWhere('finish_at','like','%'.$search.'%')
                );
            })->paginate(8)->withQueryString(),
            'filters' => \Illuminate\Support\Facades\Request::only('search'),
        ]);

UPDATE `clients` SET `deleted_at` = , `clients`.`updated_at` = '2023-07-23 00:59:06' WHERE `id` = 1
---
    public function destroy(Client $client)
    {
        $client->delete();

SELECT * FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
    public function restore(Client $client)
    {
        Client::withTrashed()->find($client->id)->restore();

SELECT * FROM `systems`
---
    public function createSystem(Client $client)
    {
        return Inertia::render('User/User_Client/Partials/Client_System/CreateEditClientSystem',[
            'systems' => System::all(),
            'client' => ['id' => $client->id,'name'=> $client->name,'lastname' => $client->lastname],
        ]);

INSERT INTO `system_client` (`client_id`, `condition`, `system_id`) VALUES (2, 'prueba', 1)
---
    public function updateSystem(ClientSystemCreateEditRequest $request, Client $client)
    {
        $conditions = collect([]);

        foreach ($request->conditions() as $index => $condition) {
            if ($request->validatedSystemsId()->contains($index)) {
                $conditions->put($index, [ 'condition' => $condition ]);
            }
        }
        $client->system_client()->sync($conditions);

SELECT * FROM `plans`
---
    public function createSuscription(Client $client)
    {
        return Inertia::render('User/User_Client/Partials/Client_Suscription/CreateEditSuscription',[
            'client' => ['id' => $client->id,'name'=> $client->name,'lastname' => $client->lastname],
            'plans' => Plan::all(),
        ]);

INSERT INTO `suscriptions` (`client_id`, `plan_id`, `user_id`, `transaction`, `ends_at`, `updated_at`, `created_at`) VALUES (1, 2, 9, 'Cash', '2023-08-22 19:25:37', '2023-07-23 01:25:37', '2023-07-23 01:25:37')
SELECT `name` FROM `plans` WHERE `id` = 1
INSERT INTO `cash_transactions` (`client_id`, `mensaje`, `formaPago`, `monto`, `suscription_id`, `updated_at`, `created_at`) VALUES (2, 'Pago Realizado con Exito, Para Membresia Mensual', 'Efectivo', 20, 21, '2023-07-22 23:57:23', '2023-07-22 23:57:23')
SELECT `price` FROM `plans` WHERE `id` = 2
INSERT INTO `cash_transactions` (`client_id`, `mensaje`, `formaPago`, `monto`, `suscription_id`, `updated_at`, `created_at`) VALUES (1, 'Pago Realizado con Exito, Para Pesas', 'Efectivo', 12, 21, '2023-07-23 01:25:37', '2023-07-23 01:25:37')
---
    public function storeSuscription(CreateEditSuscriptionClient $request, Client $client)
    {
        $request->merge([
            'user_id' => request()->user()->id,
        ]);

        if($request['plan_id'] == 1 || $request['plan_id'] == 2){ //mensualidad o pesas
            $request->merge([
                'ends_at' => Carbon::now()->addMonth()->timezone('America/El_Salvador')->toDateTimeString(),
            ]);
        }else{ //entrenamiento del dia
            $request->merge([
                'ends_at' => Carbon::now()->timezone('America/El_Salvador')->toDateTimeString(),
            ]);
        }
        $suscription = Suscription::create([
            'client_id' => $request['client_id'],
            'plan_id' => $request['plan_id'],
            'user_id' => $request['user_id'],
            'ends_at' => $request['ends_at']
        ]);

        if($request['transaction'] == 'Card'){
            //card falta logica
            $transaction = [
                'client_id' => $request['client_id'],
                'idTransaccion' => '',
                'esReal' =>'',
                'esAprobada' => '',
                'codigoAutorizacion' => '',
                'mensaje' => 'Pago Realizado con Exito, Para ' . Plan::where('id',$request['plan_id'])->pluck('name')->first(),
                'formaPago' => 'Efectivo',
                'monto' => Plan::where('id',$request['plan_id'])->pluck('price')->first(),
                'suscription_id' => $suscription->id
            ];
            CardTransaction::created($transaction);
        }
        else{
            //cash
            $transaction = [
                'client_id' => $request['client_id'],
                'mensaje' => 'Pago Realizado con Exito, Para ' . Plan::where('id',$request['plan_id'])->pluck('name')->first(),
                'formaPago' => 'Efectivo',
                'monto' => Plan::where('id',$request['plan_id'])->pluck('price')->first(),
                'suscription_id' => $suscription->id
            ];
            CashTransaction::create($transaction);

SELECT * FROM `suscriptions` WHERE `suscriptions`.`id` = 7 LIMIT 1
---
    public function showSuscription(Client $client,int $id)
    {
        return Inertia::render('User/User_Client/Partials/Client_Suscription/ClientSuscriptionShow',[
            'client' => $client->makeHidden(['genre','birth_date','height','weight','email_verified_at','created_at','updated_at']),
            'suscription' => Suscription::with(['plan'])->find($id),
            'transaction' => (CardTransaction::where('suscription_id',$id)->first() ?  CardTransaction::where('suscription_id',$id)->first() : CashTransaction::where('suscription_id',$id)->first()),
        ]);

SELECT * FROM `card_transactions` WHERE `suscription_id` = 21 LIMIT 1
SELECT * FROM `suscriptions` WHERE `suscriptions`.`id` = 21 LIMIT 1
---
    public function suscriptionInvoice(Client $client,int $id)
    {
        $pdf = \Barryvdh\DomPDF\Facade\Pdf::loadView('suscription-invoice',[
            'client' => $client,
            'transaction' => (CardTransaction::where('suscription_id',$id)->first() ?  CardTransaction::where('suscription_id',$id)->first() : CashTransaction::where('suscription_id',$id)->first()),
            'suscription' => Suscription::find($id),
        ]);

SELECT * FROM `training_sessions`
---
    public function assignAttendance(Client $client)
    {
        return Inertia::render('User/User_Client/Partials/Client_TrainingSessions/ClientTrainingSessionAssign',[
            'training_sessions' => TrainingSession::whereDoesntHave('attendancesClients', function ($query) use($client){
                return $query->where('client_id', $client->id);
            })->get(),
            'client' => ['id' => $client->id,'name'=> $client->name,'lastname' => $client->lastname],
        ]);

INSERT INTO `attendances` (`client_id`, `training_session_id`) VALUES (1, 1)
---
    public function storeAttendance(Client $client,ClientTrainingSessionCreateRequest $request)
    {
        $client->attendances_training_sessions()->attach($request->validatedTrainingSessionsId());

SELECT * FROM `training_sessions` WHERE `training_sessions`.`id` = 1 LIMIT 1
UPDATE `attendances` SET `attendance_date` = '2023-07-03T17:54' WHERE `attendances`.`client_id` = 1 and `training_session_id` in (1)
---
    public function registerAttendanceDate(Client $client,int $id, Request $request)
    {
        $attr = $request->validate([
            'attendance_date' => ['required']
        ]);
        $training_session = TrainingSession::find($id);
        $attendance_date = new \DateTime($attr['attendance_date']);
        $starts_At = new \DateTime($training_session->starts_at);
        $finish_At = new \DateTime($training_session->finish_at);

        if((($attendance_date >= $starts_At)  && ($attendance_date <= $finish_At) ))
        {
            $client->attendances_training_sessions()->updateExistingPivot($id, ['attendance_date' => $attr['attendance_date']]);

DELETE FROM `attendances` WHERE `attendances`.`client_id` = 1 and `attendances`.`training_session_id` in (1)
---
    public function destroyAttendace(Client $client,int $id)
    {
        $client->attendances_training_sessions()->detach($id);