app/Http/Controllers/HomeController.php

    public function create()
    {
        return Inertia::render('Welcome',[
            'canLogin' => Route::has('login'),
            'gym' => Gym::select(['id','address','email','phone'])->where('id','1')->first(),
            'plans' => Plan::all()
        ]);
---
SELECT `id`, `address`, `email`, `phone` FROM `gyms` WHERE `id` = '1' and `gyms`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `plans`