app/Models/Client.php

    public function resolveRouteBinding($value, $field = null)
    {
        return $this->where($field ?? 'id', $value)->withTrashed()->firstOrFail();
---
SELECT * FROM `clients` WHERE `id` = '1' LIMIT 1